app/views/contracts/_contract.html.erb

                          <small>created by: <%= article.user.password_digest if article.user %><br />
                          created_at: <%= time_ago_in_words(Article.last.created_at)%> ago <br />
---
SELECT  "articles".* FROM "articles" ORDER BY "articles"."id" DESC LIMIT ?  [["LIMIT", 1]]