app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles"
---
    def index
        @articles = Article.paginate(page: params[:page])

INSERT INTO "articles" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "Test user"], ["description", "Create article to test User"], ["created_at", "2017-09-21 18:50:48.841600"], ["updated_at", "2017-09-21 18:50:48.841600"], ["user_id", 3]]
---
    def create
    @article = Article.new(article_params) # in private section
    @article.user = current_user
        if @article.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
    def set_article # is in before_action (on top)
        @article = Article.find(params[:id])