app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "jhfjr@gfj.com"], ["LIMIT", 1]]
---
    def create
       user = User.find_by(email: params[:session][:email].downcase) # will look/compare for exact email when session create