app/controllers/transactions_controller.rb

  def new
    @transaction = Transaction.new
    @users = User.all
    @user = User.find(9)
---
SELECT "users".* FROM "users"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]

  def create
    @transaction = Transaction.new(transaction_params) # in private section
    @transaction.user = current_user
    if @transaction.save
        flash[:success] = "File was succesfully sent."
        redirect_to "/users/9"
        Article.last.update_attribute(:created_at, Time.now)
---
INSERT INTO "transactions" ("user_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["user_id", 9], ["created_at", "2018-02-24 18:52:19.606629"], ["updated_at", "2018-02-24 18:52:19.606629"]]
SELECT  "articles".* FROM "articles" ORDER BY "articles"."id" DESC LIMIT ?  [["LIMIT", 1]]
UPDATE "articles" SET "created_at" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["created_at", "2018-02-24 21:18:14.332708"], ["updated_at", "2018-02-24 21:18:14.333563"], ["id", 12]]