app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?)
---
    def create
        @user = User.new(user_params) # in private section
        if @user.save

UPDATE "users" SET "username" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "Update account"], ["password_digest", "$2a$10$mEkemiFKeiH0u1v8K8Ag4eKhOrOLQ2cmwI84e.uARFIPbsNOed5dW"], ["updated_at", "2017-09-26 18:19:55.180123"], ["id", 3]]
---
    def update
        if @user.update(user_params)

SELECT  "articles".* FROM "articles" WHERE "articles"."user_id" = ? LIMIT ? OFFSET ?  [["user_id", 3], ["LIMIT", 3], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 3]]
---
    def show
        @user_articles = @user.articles.paginate(page: params[:page])