app/views/transactions/_modal_generate.html.erb

<!-- Modal -->
<% @user = User.find(9) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]

            <div class="col-sm-9">
                <p><%= User.all.take(3).last %></p>
---
SELECT  "users".* FROM "users" LIMIT ?  [["LIMIT", 3]]