app/views/transactions/new.html.erb

                <div class="col-sm-8">
                    <%= select_tag "Transaction", options_for_select(@users.collect{ |user| [user.username]}.insert(0, "Select a receiver")), class: "form-control" %>
---
SELECT "users".* FROM "users"